[{"tweet":"An honour to find myself, and many of mine and recommendations, quoted in this report by the thorough  The report is damming in places and well worth a read! http  #climatechange #energy #nationalsecurity #infrastructure  🧵[1\/8]"},{"tweet":"Global energy prices warning from the World Bank - #the_world_bank #world_bank #energy #world #bank"},{"tweet":"Government urged to rethink #TBESS benefit cap Retail Ireland #energy"},{"tweet":"Types Of Energy Vampires [Personality Traits]  http  Energy vampires often take advantage of vulnerable people. They use this power to manipulate their victims into doing what they want, taking advantage of their trust. #energyvampires #energyvampire #energy"},{"tweet":"African Energy latest: Equatorial Power secures funding for mini-grids in Rwanda and DR Congo. http  #africanenergy #energy #rwanda #drcongo #solarenergy #renewableenergy #minigrids #funding #power"},{"tweet":"Navigating the rising business costs has never been more confusing   We've put together a guide to the pros of using an #Energy consultant like GAS.   Find out more 👇 http  #BusinessEnergy #EnergyRelief"},{"tweet":"How good is VPX Sports #PurpleHaze? #Supplements #Review #TasteTest #Tasting #Fitness #Energy"},{"tweet":"#DidYouKnow under #POWERTHON2022, a hackathon competition for enabling Advanced Technology in the Power Distribution sector, the TSPs have been tasked to find innovative solutions based on advanced emerging technologies like AI\/ML, Blockchain, IoT, AR\/VR etc.  #technology #energy"},{"tweet":"Improve Your Skills Taking Part In Hacktoberfest  #business #community #experience #energy #training #projects #network #softwaredevelopment   http"},{"tweet":"We’re with Lambeth’s Health &amp; Wellbeing Bus! 🗺️ Moorlands Community Centre, 50a Corry Drive, SW9 8QT 10am to 4pm Providing advice #support including benefits and energy efficiency. If you’ve an #advice query pop in and see us.😊  @LambethTogether  #lambeth #support #energy"}]